#!/bin/bash

set -e


#########################################
# 环境检测
#########################################

OS=$(uname -s)


if [[ "$OS" == "Linux" ]]
then
    echo "Linux/WSL 环境"

elif [[ "$OS" == MINGW* ]] || [[ "$OS" == MSYS* ]]
then
    echo "Git Bash 环境"

elif [[ "$OS" == CYGWIN* ]]
then
    echo "Cygwin 环境"

else

    echo "================================"
    echo "不支持的环境: $OS"
    echo "================================"
    exit 1

fi



#########################################
# Docker检测
#########################################

if ! command -v docker >/dev/null 2>&1
then
    echo "未检测到 docker"
    exit 1
fi



#########################################
# 镜像配置
#########################################

IMAGE_NAME="hackermmzz/judge"

QT_IMAGE="hackermmzz/qt-env:latest"

QT_TAR="qt-env.tar"


# 时间版本
VERSION=$(date +"%Y%m%d_%H%M%S")


VERSION_IMAGE="${IMAGE_NAME}:${VERSION}"

LATEST_IMAGE="${IMAGE_NAME}:latest"



echo "当前版本: ${VERSION}"



#########################################
# 更新 qt-env
#########################################

echo "=============================="
echo "1. 更新 qt-env"
echo "=============================="


docker pull $QT_IMAGE



#########################################
# 导出 qt-env
#########################################

echo "=============================="
echo "2. 导出 qt-env"
echo "=============================="


rm -f $QT_TAR


docker save \
    $QT_IMAGE \
    -o $QT_TAR



#########################################
# 构建镜像
#########################################

echo "=============================="
echo "3. build judge"
echo "=============================="


docker build \
    -t $VERSION_IMAGE \
    -t $LATEST_IMAGE \
    .



#########################################
# 清理临时文件
#########################################

echo "=============================="
echo "4. 清理"
echo "=============================="


rm -f $QT_TAR


docker image prune -f



#########################################
# 推送版本
#########################################

echo "=============================="
echo "5. push version"
echo "=============================="


docker push $VERSION_IMAGE



#########################################
# 推送latest
#########################################

echo "=============================="
echo "6. push latest"
echo "=============================="


docker push $LATEST_IMAGE



echo "=============================="
echo "完成"
echo "=============================="

echo "版本:"
echo "$VERSION_IMAGE"
echo "$LATEST_IMAGE"